Revit 2024 API
NurbsSurfaceData Class
 A class used to represent the definition of a NURBS surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class NurbsSurfaceData : IDisposable
Visual Basic
Public Class NurbsSurfaceData _
	Implements IDisposable
Visual C++
public ref class NurbsSurfaceData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NurbsSurfaceData
See Also
NurbsSurfaceData Members
Autodesk.Revit.DB Namespace